tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

source1
{
    type            fixedTemperatureConstraint;
    active          true;
    timeStart       0.1;
    duration        0.4;
    selectionMode   cellSet;
    cellSet         ignitionCells;

    fixedTemperatureConstraintCoeffs
    {
        mode            uniform;
        temperature     2000;
    }
}


// ************************************************************************* //
